<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>PayloadContent</key>
	<array>
		<dict>
			<key>PayloadContent</key>
			<dict>
				<key>com.khulnasoft.privileges</key>
				<dict>
					<key>Forced</key>
					<array>
						<dict>
							<key>mcx_preference_settings</key>
							<dict>
                                				<!--
                                    					key:    RequireAuthentication
                                    					value:  a boolean
                                    
                                    					Specifies whether authentication is required to obtain administrator
                                    					privileges. If set to true, the user is prompted for the account
                                    					password (or Touch ID, if available). Note that once this option is
                                    					enabled, privileges cannot be changed from the Privileges Dock tile menu
                                    					unless AllowCLIBiometricAuthentication is also enabled.
                                				-->
                                				<key>RequireAuthentication</key>
                                				<true/>
                                
                                				<!--
                                    					key:    AllowCLIBiometricAuthentication
                                    					value:  a boolean
                                    
                                    					Specifies whether to allow biometric authentication in the PrivilegesCLI
                                    					to obtain administrator privileges. If set to true, the Privileges agent
                                    					prompts the user for the account password (or Touch ID, if available).
                                				-->
                                				<key>AllowCLIBiometricAuthentication</key>
                                				<true/>
							</dict>
						</dict>
					</array>
				</dict>
			</dict>
			<key>PayloadDescription</key>
			<string/>
			<key>PayloadDisplayName</key>
			<string>Privileges configuration</string>
			<key>PayloadEnabled</key>
			<true/>
			<key>PayloadIdentifier</key>
			<string>com.apple.ManagedClient.preferences.36132147-235E-4663-ADA8-2664C67C4DD2</string>
			<key>PayloadOrganization</key>
			<string>KhulnaSoft, Ltd</string>
			<key>PayloadType</key>
			<string>com.apple.ManagedClient.preferences</string>
			<key>PayloadUUID</key>
			<string>36132147-235E-4663-ADA8-2664C67C4DD2</string>
			<key>PayloadVersion</key>
			<integer>1</integer>
		</dict>
	</array>
	<key>PayloadDescription</key>
	<string>Configures the Privileges app.</string>
	<key>PayloadDisplayName</key>
	<string>Privileges configuration</string>
	<key>PayloadEnabled</key>
	<true/>
	<key>PayloadIdentifier</key>
	<string>CF401A42-35CA-4DA6-9123-5A49C87ECB5A</string>
	<key>PayloadOrganization</key>
	<string>KhulnaSoft, Ltd</string>
	<key>PayloadRemovalDisallowed</key>
	<true/>
	<key>PayloadScope</key>
	<string>System</string>
	<key>PayloadType</key>
	<string>Configuration</string>
	<key>PayloadUUID</key>
	<string>50870D16-7AAD-478B-BFFE-BED09499F7E0</string>
	<key>PayloadVersion</key>
	<integer>1</integer>
</dict>
</plist>
